oldlinux-web/oldlinux-files/Minix/CD-ROM-2.0/MINIX/MANUALS/MAN5/HOSTS.5
.TH HOSTS 5
.SH NAME
hosts \- hostname to IP address database
.SH SYNOPSIS
.B /etc/hosts
.SH DESCRIPTION
The hosts database lists the IP addresses and the hostnames that translate
to these IP addresses.  It is used by
.BR nonamed (8)
in a network without name servers.  A simple
.B /etc/hosts
may look like this:
.PP
.RS
.ta +15n +10n
.nf
127.0.0.1	localhost
192.9.200.1	darask
192.9.200.2	burask
.fi
.RE
.PP
The localhost entry lists a special address that refers to the local host
itself (a kind of /dev/tty for hosts.)  You should only list it if
.B nonamed
needs it!  The other entries are actual machines.  The file may contain
comments marked with '#'.
.PP
You can have aliases (more hostnames on the same line), but it is not
recommended, because
.B nonamed
can't present them to the system as CNAME records.  An often seen form like
.PP
.RS
192.9.200.1	darask.home.cs.vu.nl\0\0darask
.RE
.PP
is harmless though, and has the small advantage that you can use the short
name in
.B /etc/ethers
so
.B rarpd
can match it at boot time.
.SH FILES
.TP 15n
/etc/hosts
Hosts database.
.SH "SEE ALSO"
.BR ethers (5),
.BR nonamed (8),
.BR rarpd (8),
.BR boot (8).
.SH AUTHOR
Kees J. Bot (kjb@cs.vu.nl)
