oldlinux-web/oldlinux-files/Minix/CD-ROM-2.0/MINIX/MANUALS/MAN5/RHOSTS.5
.TH RHOSTS 5
.SH NAME
rhosts, hosts.equiv \- trusted remote users or hosts
.SH SYNOPSIS
.BI ~ user /.rhosts
.br
.B /etc/hosts.equiv
.SH DESCRIPTION
The per user
.B .rhosts
and the per system
.B hosts.equiv
files can be used to allow users to use
.B rlogin
or
.B rsh
without a password.  The remote login services first check the system wide
.B /etc/hosts.equiv
file and then the
.BI ~ user /.rhosts
of the intended user.  Both files contain lines of one of two forms:
.PP
.RS
.I host
.br
.I host ruser
.RE
.PP
The first form tells that any user from
.I host
is allowed to login to this system under the same name.  The second form
allows
.I ruser
from
.I host
to login.
.PP
The
.B .rhosts
file is checked to be owned by
.I user
or root, and only its owner may be able to write it.
.SH "SEE ALSO"
.BR rlogin (1),
.BR rsh (1).
.SH NOTES
Minix has no restrictions on becoming super-user remotely.  Other systems
usually do.
.SH AUTHOR
Kees J. Bot (kjb@cs.vu.nl)
