oldlinux-web/oldlinux-files/Minix/CD-ROM-2.0/MINIX/MANUALS/MAN8/GETTY.8
.TH GETTY 8
.SH NAME
getty \- system login banner
.SH SYNOPSIS
.B getty
.RI [ banner " ...]"
.SH DESCRIPTION
.B Getty
displays a system identification banner, reads a user name from standard
input and executes
.B login
with that name as argument.
.PP
.B Getty
uses its arguments separated by spaces as a login banner.  The character
sequences
.BR \en ,
.BR \es
and
.BR \et
are printed as newline, space and tab.  Any other
.BI \e x
prints that
.IR x .
The character sequences
.BR %s ,
.BR %n ,
etc. produce the same output as
.BR "uname \-s" ,
.BR "uname \-n" ,
etc.  The default banner is
.PP
.RS
%s\es\esRelease\es%r\esVersion\es%v\en\en%n\eslogin:\es
.RE
.PP
The only other useful functionality offered by
.B getty
is that it can be suspended by signal SIGUSR1 and restarted by SIGUSR2.
This allows a program such as
.BR modem (1)
to temporarily claim a dialin line for dialout.
.SH "SEE ALSO"
.BR modem (1),
.BR ttytab (5),
.BR init (8).
.SH BUGS
.B Getty
should be taught about modems and modem lines.  The signal trick is an awful
hack.
.SH AUTHOR
Kees J. Bot (kjb@cs.vu.nl)
