oldlinux-web/oldlinux-files/Minix/CD-ROM-2.0/MINIX/MANUALS/MAN8/NCHECK.8
.TH NCHECK 8
.SH NAME
ncheck \- i-node to name converter
.SH SYNOPSIS
\fBncheck\fR [\fB\-i\fI numbers\fR] [\fB\-a\fR] [\fB\-s\fR] \fIfile_system\fR\fR
.br
.de FL
.TP
\\fB\\$1\\fR
\\$2
..
.de EX
.TP 20
\\fB\\$1\\fR
# \\$2
..
.SH OPTIONS
.FL "\-a" "List all files, even . and .."
.FL "\-i" "Followed by a list of i-nodes"
.FL "\-s" "List only special and setuid files"
.SH EXAMPLES
.EX "ncheck \- /dev/fd0" "List everything on \fI/dev/fd0\fR"
.EX "ncheck \-i 10,15 /dev/fd0" "List i-nodes 10 and 15 on \fI/dev/fd0\fR"
.SH DESCRIPTION
.PP
Sometimes one knows about an i-node number and wants to find the file
name that goes with it.  This program makes that mapping.
The default is to list everything on the device, but the \fB\-i\fR
flag restricts the list to specified i-nodes and the \fB\-s\fR flag
restricts it to special files and setuid files (to look for possible
security violations).
.SH "SEE ALSO"
.BR fsck (1).
