oldlinux-web/oldlinux-files/Minix/CD-ROM-2.0/MINIX/MANUALS/MAN8/RARPD.8
.TH RARPD 8
.SH NAME
rarpd \- reverse address resolution protocol daemon
.SH SYNOPSIS
.B rarpd
.RB [ \-d ]
.SH DESCRIPTION
.B Rarpd
listens on the ethernet for broadcast packets asking for reverse address
resolution.  These packets are sent by hosts at boot time to find out their
IP address.
.B Rarpd
looks up the six octet ethernet number in the
.B /etc/ethers
file finding a host name.  This name is translated to the IP address of the
host by a DNS lookup.  The IP address is then sent to the host.
.PP
Before
.B rarpd
can start its service it first finds out what the IP addresses of the
ethernets are.  It will look through
.B /etc/ethers
to map the ethernet addresses to host names.  It then uses
.B /etc/hosts
to map the host names to IP addresses.  If this lookup fails then several
RARP requests are broadcasted in the hope that some RARP server knows the
addresses.  The IP addresses are eventually set in the same way as
.BR ifconfig (8).
(The address is not changed if already set with
.BR ifconfig .)
Note that the host names in the ethers and hosts files must match exactly.
The DNS can not be used yet, so a simple name can't be translated to a fully
qualified name.
.PP
.B Rarpd
exits after startup if there are no active ethernets, or if there is no
ethers file.
.PP
.B Warning!
Sun diskless workstations assume that the first RARP server that answers is
the host they are to boot from.  For this to work all other Sun RARP servers
delay their answer if they are not also the requestors boot server.  The
Minix
.B rarpd
does not have this kludge so it will happily engage the Sun boot server to
see who can answer the client first.  Unless your Minix host can actually
serve a Sun diskless client, it is better not to list any more hosts in the
ethers file than necessary.
.SH OPTIONS
.TP
.B \-d
Turns on debugging messages.  Debugging can also be turned on at runtime by
sending signal
.B SIGUSR1
or turned off with
.BR SIGUSR2 .
.SH "SEE ALSO"
.BR ifconfig (8),
.BR ethers (5),
.BR hosts (5),
.BR set_net_default (8),
.BR boot (8),
.BR inetd (8),
.BR irdpd (8),
.BR nonamed (8).
.SH AUTHOR
Kees J. Bot (kjb@cs.vu.nl)
