oldlinux-web/oldlinux-files/Minix/CD-ROM-2.0/MINIX/MANUALS/MAN8/S_N_D.8
.TH SET_NET_DEFAULT 8
.SH NAME
s_n_d, set_net_default \- select the default TCP/IP network
.SH SYNOPSIS
.B "set_net_default: not found"
.SH DESCRIPTION
This manual page is here because so many others refer to it.  The
.B set_net_default
command does not exist under standard Minix, because the TCP/IP server only
supports one network.  The server under Minix-vmd supports four different
networks, that can each be chosen as the default network.
.PP
The TCP/IP library and commands do have a notion about a "default network"
however, because the code is shared between the Minix versions.  So if you
want to venture into network programming then you should know about the
devices and environment variables mentioned below to make your program
compatible.  (Especially since there is a plan to upgrade the TCP/IP server
for standard Minix.)
.SS "Options and environment to change the default"
Many TCP/IP programs implement the following options and environment
variables to change the default devices set by
.BR set_net_default .
The options are only implemented for low level programs where it makes sense
to name a network device.  The environment variables are used in all code.
You can run a process and all its children connected to a different network
by setting four environment variables.
.PP
.BI ETH_DEVICE= device
.br
.BI -E " device"
.RS
Device to use as raw ethernet device instead of the default /dev/eth.
.RE
.PP
.BI PSIP_DEVICE= device
.br
.BI -P " device"
.RS
Pseudo IP device to use instead of /dev/psip.
.RE
.PP
.BI IP_DEVICE= device
.br
.BI -I " device"
.RS
IP device to use instead of /dev/ip.
.RE
.PP
.BI TCP_DEVICE= device
.br
.BI -T " device"
.RS
TCP device to use.
.RE
.PP
.BI UDP_DEVICE= device
.br
.BI -U " device"
.RS
UDP device to use.
.RE
.SH FILES
.IP /dev/eth[01] 18n
First and second raw ethernet.
.IP /dev/psip[01]
First and second Pseudo IP network.
.IP /dev/ip[0123]
IP devices for two ethernets and two Pseudo IP networks.
.IP /dev/tcp[0123]
TCP devices for same four networks.
.IP /dev/udp[0123]
UDP devices.
.IP "/dev/eth, /dev/psip, /dev/ip, /dev/tcp, /dev/udp"
Devices for the default network, links to the devices above.
.B Eth
is only present if ethernet is the default,
.B psip
only for pseudo IP.
.SH "SEE ALSO"
.BR ip (4),
.BR boot (8).
.SH AUTHOR
Kees J. Bot (kjb@cs.vu.nl)
